In [1]:
import pandas as pd

In [2]:
student_list = [
    {'name':'John', 'major':'Computer Science', 'sex':'male'},
    {'name':'Nate', 'major':'Computer Science', 'sex':'male'},
    {'name':'Edward', 'major':'Computer Science', 'sex':'male'},
    {'name':'Zara', 'major':'Psychology', 'sex':'female'},
    {'name':'John', 'major':'Computer Science', 'sex':'male'}
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [3]:
#중복된 행 알아보기
# True가 중복이라는 뜻
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [4]:
#중복 삭제
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [6]:
student_list = [
    {'name':'John', 'major':'Computer Science', 'sex':'male'},
    {'name':'Nate', 'major':'Computer Science', 'sex':'male'},
    {'name':'Edward', 'major':'Computer Science', 'sex':'male'},
    {'name':'Zara', 'major':'Psychology', 'sex':'female'},
    {'name':'Wendy', 'major':'Economics', 'sex':'female'},
    {'name':'Nate', 'major':'None', 'sex':'male'},
    {'name':'John', 'major':'Economics', 'sex':'male'}
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [7]:
df.duplicated(['name'])  #이름이 같으면 중복이다

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [11]:
df.drop_duplicates(['name'], keep = 'first')  #앞에 값 유지/ 뒤에값 유지하려면 'last'
#keep = 'first'가 default

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female